# RemoveCutLayerModifier Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..RemoveCutLayerModifier Method
ExportLayerInfo Class See Also
---
Removes a cut layer modifier from the layer info.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RemoveCutLayerModifier(
	LayerModifier layerModifier
)
```

Visual Basic
---
```text
Public Sub RemoveCutLayerModifier ( _
	layerModifier As LayerModifier _
)
```

Visual C++
---
```text
public:
void RemoveCutLayerModifier(
	LayerModifier^ layerModifier
)
```

# ### Parameters
layerModifier
    Type: Autodesk.Revit.DB..::..LayerModifier The cut layer modifier.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace